{
  "list":[
    {
      "text": "На экзамене 25 билетов, Сергей не выучил 3 из них. Найдите вероятность того, что ему попадётся выученный билет.",
      "answer": 88
    },
    {
      "text": "Коля выбирает трехзначное число. Найдите вероятность того, что оно делится на 5.",
      "answer": 20
    },
    {
      "text": "Телевизор у Маши сломался и показывает только один случайный канал. Маша включает телевизор. В это время по трем каналам из двадцати показывают кинокомедии. Найдите вероятность того, что Маша попадет на канал, где комедия не идет.",
      "answer": 85
    },
    {
      "text": "На тарелке 12 пирожков: 5 с мясом, 4 с капустой и 3 с вишней. Наташа наугад выбирает один пирожок. Найдите вероятность того, что он окажется с вишней.",
      "answer": 25
    },
    {
      "text": "В фирме такси в данный момент свободно 20 машин: 9 черных, 4 желтых и 7 зеленых. По вызову выехала одна из машин, случайно оказавшаяся ближе всего к заказчику. Найдите вероятность того, что к нему приедет желтое такси.",
      "answer": 20
    },
    {
      "text": "В каждой десятой банке кофе согласно условиям акции есть приз. Призы распределены по банкам случайно. Варя покупает банку кофе в надежде выиграть приз. Найдите вероятность того, что Варя не найдет приз в своей банке.",
      "answer": 90
    },
    {
      "text": "Миша с папой решили покататься на колесе обозрения. Всего на колесе двадцать четыре кабинки, из них 5 — синие, 7 — зеленые, остальные — красные. Кабинки по очереди подходят к платформе для посадки. Найдите вероятность того, что Миша прокатится в красной кабинке.",
      "answer": 50
    },
    {
      "text": "У бабушки 20 чашек: 5 с красными цветами, остальные с синими. Бабушка наливает чай в случайно выбранную чашку. Найдите вероятность того, что это будет чашка с синими цветами.",
      "answer": 75
    },
    {
      "text": "Родительский комитет закупил 25 пазлов для подарков детям на окончание года, из них 15 с машинами и 10 с видами городов. Подарки распределяются случайным образом. Найдите вероятность того, что Толе достанется пазл с машиной.",
      "answer": 60
    },
    {
      "text": "В среднем из каждых 80 поступивших в продажу аккумуляторов 76 аккумуляторов заряжены. Найдите вероятность того, что купленный аккумулятор не заряжен.",
      "answer": 5
    },
    {
      "text": "Для экзамена подготовили билеты с номерами от 1 до 50. Какова вероятность того, что наугад взятый учеником билет имеет однозначный номер?",
      "answer": 18
    },
    {
      "text": "В мешке содержатся жетоны с номерами от 5 до 54 включительно. Какова вероятность, того, что извлеченный наугад из мешка жетон содержит двузначное число?",
      "answer": 90
    },
    {
      "text": "Из 900 новых флеш-карт в среднем 54 не пригодны для записи. Какова вероятность того, что случайно выбранная флеш-карта пригодна для записи?",
      "answer": 94
    },
    {
      "text": "В чемпионате по футболу участвуют 16 команд, которые жеребьевкой распределяются на 4 группы: A, B, C и D. Какова вероятность того, что команда России не попадает в группу A?",
      "answer": 75
    },
    {
      "text": "В группе из 20 российских туристов несколько человек владеют иностранными языками. Из них пятеро говорят только по-английски, трое только по-французски, двое по-французски и по-английски. Какова вероятность того, что случайно выбранный турист говорит по-французски?",
      "answer": 25
    }
  ]
}