{
  "list": [
    {
      "text": "В амфитеатре 10 рядов. В первом ряду 25 мест, а в каждом следующем на 3 места больше, чем в предыдущем. Сколько мест в восьмом ряду амфитеатра?",
      "answer": 46
    },
    {
      "text": "В ходе распада радиоактивного изотопа его масса уменьшается вдвое каждые 7 минут. В начальный момент масса изотопа составляла 640 мг. Найдите массу изотопа через 42 минуты. Ответ дайте в миллиграммах, в целых числах.",
      "answer": 10
    },
    {
      "text": "В ходе биологического эксперимента в чашку Петри с питательной средой поместили колонию микроорганизмов массой 13мг. За каждые 30 минут масса колонии увеличивается в 3 раза. Найдите массу колонии микроорганизмов через 90 минут после начала эксперимента. Ответ дайте в миллиграммах, в целых числах.",
      "answer": 351
    },
    {
      "text": "В ходе бета-распада радиоактивного изотопа А каждые 8 минут половина его атомов без потери массы преобразуются в атомы стабильного изотопа Б. В начальный момент масса изотопа А составляла 160 мг. Найдите массу образовавшегося изотопа Б через 40 минут. Ответ дайте в миллиграммах, в целых числах.",
      "answer": 155
    },
    {
      "text": "При проведении опыта вещество равномерно охлаждали в течение 10 минут. При этом каждую минуту температура вещества уменьшалась на 6 °C. Найдите температуру вещества (в градусах Цельсия) через 4 минуты после начала проведения опыта, если его начальная температура составляла -7°C.",
      "answer": -31
    },
    {
      "text": "У Тани есть теннисный мячик. Она со всей силы бросила его об асфальт. После первого отскока мячик подлетел на высоту 360 см, а после каждого следующего отскока от асфальта подлетал на высоту в три раза меньше предыдущей. После какого по счёту отскока высота, на которую подлетит мячик, станет меньше 15см?",
      "answer": 4
    },
    {
      "text": "Камень бросают в глубокое ущелье. При этом в первую секунду он пролетает 9 метров, а в каждую следующую секунду на 10 метров больше, чем в предыдущую, до тех пор, пока не достигнет дна ущелья. Сколько метров пролетит камень за первые пять секунд?",
      "answer": 145
    },
    {
      "text": "В амфитеатре 14 рядов, причём в каждом следующем ряду на одно и то же число мест больше, чем в предыдущем. В пятом ряду 27 мест, а в восьмом ряду 36 мест. Сколько мест в последнем ряду амфитеатра?",
      "answer": 54
    },
    {
      "text": "Бизнесмен Бубликов получил в 2000 году прибыль в размере 5000 рублей. Каждый следующий год его прибыль увеличивалась на 300% по сравнению с предыдущим годом. Сколько рублей заработал Бубликов за 2003 год?",
      "answer": 320000
    }
  ]
}